'{
    "id": 8826,
    "Business Name": "Broken We Can Fix It",
    "url": "https://www.yelp.com/biz/broken-we-can-fix-it-glendale",
    "average rating": null,
    "number of reviews": 66,
    "number of scraped reviews": 66,
    "address": "889 Americana Way$ Glendale, CA 91210$ Get directions$ ",
    "phone": "(747) 272-3713",
    "website": "brokenwecanfixit.com",
    "reviews": {
        "0": {
            "user": "Michelle A.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/1/2018",
            "comment": "Perfect, fast, affordable service!This is a booth located right outside of Sephora. I initially went to the Apple Store to get my iPhone screen repaired thinking it was under Apple Care, but I was told I need more than just the Basic Apple Care to get the screen repaired for cheap. Plus it would take two hours! I walked out and found this booth. The man at the booth told me he can do it under 15 minutes plus there was a $5 Yelp deal in addition to a free screen protector that he installed."
        },
        "1": {
            "user": "Scott R.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "4/21/2018",
            "comment": "Josh is a hard working dude. Got right to it and replaced an iPhone screen for less than half of what Apple charges a few doors away. Oh, and he is polite! \\u00a0Stop here, if your screen has seen better days, price was great, service was immediate!"
        },
        "2": {
            "user": "Alena M.",
            "rating": 2,
            "location": "Burbank, CA",
            "date posted": "6/12/2018",
            "comment": "I was shopping and wanted to get my very cracked iPhone 7 screen fixed. This place has great reviews, so we figured we\'d get it taken care of. Adrian was extremely fast (20 minutes) and affordable, an easy stop while at the mall. I was very happy with Adrian and his service, the quality of his worked was great and I\'d give him five stars.However, a couple hours later I started noticing that my phone screen was not working correctly. My swipping behaved like a tap, and some taps aren\'t registering at all. Because they don\'t have manufacturer products (at least not for iPhone), I have read now that this can happen. I\'d recommend not spending the money if it might not work here, and dishing out the full amount at a place with manufacturer screens.I don\'t like writing negative reviews, but I have to warn others that there is a risk you will pay for something that doesn\'t work. I see it has worked for other people here, so the gamble is yours!"
        },
        "3": {
            "user": "Alice H.",
            "rating": 5,
            "location": "La Puente, CA",
            "date posted": "7/6/2016",
            "comment": "Wanted a new screen protector and I ended up taking it to Matt at the Ucolor cart and he installed the screen cover in under 20 minutes. Great job! Highly recommended!"
        },
        "4": {
            "user": "Steph K.",
            "rating": 1,
            "location": "Eagle Rock, Los Angeles, CA",
            "date posted": "1/8/2018",
            "comment": "DO NOT DO NOT TAKE YOUR PHONE \\u00a0HERE !!!! They are nothing but a dam rip off, I took left my phone with them in the evening while I went to watch a late show with my kids .took my phone home and it wouldn\'t charge .Brought it back the very next morning the guy opened it up and told me they didn\'t have a good connection with the battery he showed me it was charging I got my phone went home ...when I got home I noticed a crack on n the screen which I had just had replaced the day before by them .I called immediately and spoke to them told them what happened and that \\u00a0when they reopened my phone they obviously cracked my screen he said go ahead and bring it back .... i had to work so I took it back today told EVAN about everything that happen d since I had my phone done with them he called his manager and they both decided that it was my fault the screen was cracked it is not under warranty and wanted me to pay another 80 dollars or so.... I told MR EVAN THAT I WAS Pissed BECAUSE ITS NOT MY FAULT , he has the most awesome customer service . The idiot says it\'s never the customers fault I would give zero stars and recommend \\u00a0 Either just going through Apple or the other repair shop by the sprint store on brand this place is horrible .."
        },
        "5": {
            "user": "Jose C.",
            "rating": 1,
            "location": "Los Angeles, CA",
            "date posted": "10/27/2017",
            "comment": "Stay Away!!!0 Stars if I could give it a 0!The screen replacements are of very poor quality! \\u00a0My screen is very grainy and looks blue and grey. Scrolling is no longer smooth, force touch does not work correctly. I brought this up to the technician he said \\"yeah our screens are a bit off we get lots of complaints about them but if you want original you have to go to APPLE!\\" While examining the phone he said it\'s different but it\'s not that bad,he said he would replace the screen but it would be of equal quality. Paid $108 to have my warranty/value of my phone voided."
        },
        "6": {
            "user": "Trina C.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "2/24/2018",
            "comment": "Broken we can fix it Saved the day! Definitely can count on them to fix your iPhone screen perfectly. Felt like I came home with a brand new phone. Thanks josh!"
        },
        "7": {
            "user": "Lina C.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "4/29/2018",
            "comment": "Best prices in town!! Joshua was super sweet and even hooked me up with a free screen protector if I left a yelp review. Great service, great prices, why wouldn\'t you come here?"
        },
        "8": {
            "user": "Walter H.",
            "rating": 5,
            "location": "Mount Washington, Los Angeles, CA",
            "date posted": "2/6/2018",
            "comment": "Joshua was great! \\u00a0Fast and thorough... \\u00a0He replaced my screen in 15mins and it looks brand new! \\u00a0He explained to me what is needed and delivered on all the promises. \\u00a0I recommend it!"
        },
        "9": {
            "user": "Jannel G.",
            "rating": 5,
            "location": "East Bronx, NY",
            "date posted": "1/29/2018",
            "comment": "My phone cracked in the worst way! Brought my phone to Joshua and he immediately took care of it in 15 minutes. The initial fix didn\'t quite work as expected and we brought it back with no problem. He fixed it and at no additional cost. This would have been easily wayyy too expensive if brought to Apple! Thankss for saving my life!"
        },
        "10": {
            "user": "Toy S.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "8/26/2016",
            "comment": "Anthony is a life saver. I had taken my ipad to the apple store in glendale and they said they couldn\'t remove the headphone piece broken inside. They told me to buy a new one. I was sad at losing a perfectly working ipad for something that small. While walking away in anger I spotted ucolor and Anthony fixed it in a matter of seconds. I would highly recommend Anthony/Ucolor for his expertise, his professionalism and promptness in resolving my problem. Thanks Anthony you rock !"
        },
        "11": {
            "user": "Joe D.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "7/29/2016",
            "comment": "Great service and affordable prices. It only took him 15 to replace my screen. They also gave me guarantee for my screen.Totally recommend this place, like I said good prices and great service."
        },
        "12": {
            "user": "Jane M.",
            "rating": 5,
            "location": "Pomona, CA",
            "date posted": "3/19/2017",
            "comment": "Repaired my phone quickly and for a great price. Brought my phone in and only had to wait around 20 minutes for the repair - which was less than half the wait time other nearby locations offered me. Very convenient because I was able to walk around the shops while my phone was being repaired. The phone being repaired was an iPhone 6s by the way. Would definitely recommend! Fast, convenient, great price, and friendly service."
        },
        "13": {
            "user": "Dominic S.",
            "rating": 5,
            "location": "Bell, CA",
            "date posted": "10/12/2017",
            "comment": "Fast service! We unfortunately did get the name of the guy who helped us but he quickly diagnosed my girlfriend\'s phone, told her it was the battery and switched it out with a new one and even threw in a screen protector plus installation for $10! Would definitely recommend this iPhone repair shop to anyone looking for great, reasonably priced service!"
        },
        "14": {
            "user": "Hannah M.",
            "rating": 5,
            "location": "Pasadena, CA",
            "date posted": "9/24/2017",
            "comment": "This place is great! Got my cracked screen replaced in 20 minutes with no appointment for less than I was quoted anywhere else. Go here if you need quick iPhone repairs!"
        },
        "15": {
            "user": "Lawrence M.",
            "rating": 5,
            "location": "Covina, CA",
            "date posted": "1/16/2017",
            "comment": "I must\'ve dropped my iPhone like 4 times before deciding to get it fixed. Glass was barely hanging on, earpiece and front facing camera stopped working, but it was no problem for Anthony at UColor. He did an exceptional job fixing it all in under 20 mins. He was sure to test everything for me prior to me leaving his booth! Amazing technician that I would recommend to all my family and friends!"
        },
        "16": {
            "user": "B M.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "4/16/2018",
            "comment": "Great job fixing my husband\'s phone! Fast and friendly. Joshua was such a great help on the phone and in person!"
        },
        "17": {
            "user": "austin s.",
            "rating": 1,
            "location": "Voorheesville, NY",
            "date posted": "10/17/2017",
            "comment": "I know I\'m the only person to write a one star review but PLEASE BE WARNED BEFORE you bring your phone here.BOTTOM LINES:-Inferior Screens (unless you\'re ok with a yellow tinted screen)-Horrible customer experience with management -No empathy or even willingness to engage with the costumerFull ReviewI arrived at 8:30, and it took about the advertised 20 minutes to replace my screen. When I began operating my iphone7 I noticed the screen was tinted yellow, almost as if night shift had been turned on.The employee Joshua said he\'d never seen the issue before and began installing a second screen.After the second screen had been installed the SAME problem happened. Joshua called his manager, ARAMY, who told him I could get a $10 discount. I then asked to speak to Aramy, who refused to lower the price further. I explained I\'ve been there for now close to an hour, far beyond the advertised 20 minutes, AND I WAS BEING CHARGED $85 dollars for the phone. I explained I would pay Joshua for the time however, I was not going to pay for an inferior product. At this point, Aramy told me, he could replace the screen with an Olem (?? to be honest didn\'t hear accurately so this is probably an inaccurate name for the screen) but those cost $125, and they were out of stock. NO WHERE IN THEIR KIOSK is this separate type of screen advertised, not in their signage, not on-line, not via an alert from the employee. Aramy then explained that he \\"was not in the market\\" of negotiating prices for screen replacements. Which seemed ridiculous since by owning and operating an iphone repair kiosk, one would assume you are in the market for negotiating the price of screen replacements. Aramy, quickly asked to speak with this employee. And I was offered $5 more of a discount!I left with a tinted screen, without accurate color, for $80. I feel like I was fleeced."
        },
        "18": {
            "user": "Heather S.",
            "rating": 5,
            "location": "West Los Angeles, Los Angeles, CA",
            "date posted": "1/14/2017",
            "comment": "Anthony is amazing!! He fixed my insanely cracked screen in no time and was super helpful. Highly recommend coming here for phone screen repairs!"
        },
        "19": {
            "user": "Mar B.",
            "rating": 1,
            "location": "Gardena, CA",
            "date posted": "9/11/2017",
            "comment": "When i replaced glass from my iPhone 7+ i was told by the cashier that the glass had warranty, one week later the screen cracked and when i took it back Matt told me that the warranty only covers manufacture defects, i was very upset since that was not explained to me when i first fixed my phone, i would honestly give this location \\u00a0negative 5 stars"
        },
        "20": {
            "user": "Gabby T.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "11/26/2016",
            "comment": "Called in because of the amazing reviews and most definitely everyone is right about Anthony. I got my iPhone 6 fixed in a matter of 20 min, pricing is just as amazing as the service. Plus Anthony fixed the frame damage at no additional charge. Will definitely recommend.!!!"
        },
        "21": {
            "user": "John J.",
            "rating": 5,
            "location": "Santa Monica, CA",
            "date posted": "10/27/2016",
            "comment": "Anthony is a great person. My girlfriend had broken screen on her iPhone 6s, so we just left phone with him and left for a promenade. Just 20 minutes later Anthony gave us a call and cellphone was like a new from the box. Great and fast service."
        },
        "22": {
            "user": "Karo A.",
            "rating": 5,
            "location": "Burbank, CA",
            "date posted": "8/15/2016",
            "comment": "Awesome service! These guys are extremely efficient, nice, and give great service. They replaced the screen and the LCD in a matter of 10 mins, cleaned the phone and added a screen protector all for a great price. Matt is quick and super easy to talk to. Give them a try!"
        },
        "23": {
            "user": "Steven C.",
            "rating": 5,
            "location": "Arcadia, CA",
            "date posted": "3/26/2017",
            "comment": "Great customer service. He fixed my phone really fast. Within 20 minutes! I highly suggest ucolor iphone repair."
        },
        "24": {
            "user": "Matthew F.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "8/10/2016",
            "comment": "I live nearby and I was referred to this kiosk by my good friend because I had cracked my screen. The service didn\'t take too long and the quality of work was outstanding. Matt was the guy who helped me out. If you ever need any help with trouble shooting or iPhone repairs, definitely check this place out!"
        },
        "25": {
            "user": "Anna A.",
            "rating": 5,
            "location": "Glendale, Los Angeles, CA",
            "date posted": "10/18/2016",
            "comment": "Cracked my iphone 6 this weekend, so glad I found Anthony at Ucolor! He fixed my phone in 15 min and it looks and feels great! I recommend everyone to come see Anthony at Ucolor Americana to fix your phone. The price is affordable and the job is very well done. A lot of attention to detail with everything they do here."
        },
        "26": {
            "user": "Kat J.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "7/10/2016",
            "comment": "Anthony did a quick and great job fixing my phone. In addition he was very polite. I\'d definitely recommend this place for a quick and relatively inexpensive solution to broken screens."
        },
        "27": {
            "user": "Chris S.",
            "rating": 5,
            "location": "Encino, CA",
            "date posted": "7/5/2016",
            "comment": "Brought phone in for screen repair Anthony very professional and honest. Great deal fast and quick. Will come again 4sure:)))"
        },
        "28": {
            "user": "Ellie B.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/19/2016",
            "comment": "Anthony did a great job and quick too (10 mins!) Shattering your screen is awful but these guys do a great job. Very convenient. Thanks Ucolor :)"
        },
        "29": {
            "user": "Michelle M.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "8/6/2016",
            "comment": "Got my IPhone screen fixed at this location and it was quick and easy. Cheaper than the mall and looks great. Definitely recommend it. Anthony helped me and was great."
        },
        "30": {
            "user": "Paul D.",
            "rating": 5,
            "location": "Long Beach, CA",
            "date posted": "7/25/2016",
            "comment": "Anthony did a fast repair in the sweltering heat wave and the phone looks great. Broke my iPhone 6 while moving. Very happy I ran into Anthony at the Ucolor Americana kiosk. Thanks again I\'m recommending you to all my friends."
        },
        "31": {
            "user": "Cherise I.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "6/26/2016",
            "comment": "Anthony was great! Quick service and perfectly repaired screen. Will definitely come back"
        },
        "32": {
            "user": "Andy G.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/15/2016",
            "comment": "Broke my 6S screen and got the run around at Apple, so I stumbled across Ucolor between to Katsuya and Topshop and Matt fixed my phone for less than half the cost of replacing my phone. And he fixed the dents and minor frame damage at no extra cost. Also picked up a screen protector and bumper case to help prevent further damage. I recommend Ucolor and Matt to anyone looking for a less expensive alternative to Apple. Ucolor even offers a 6mo warranty!!! Thanks for the service Matt. Very professional and thorough."
        },
        "33": {
            "user": "Andrea L.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "1/3/2017",
            "comment": "I went by to get my broken iPhone 6 fixed, and Matthew was awesome! He made everything so easy, very friendly, very professional. It was a really great experience, if you need an affordable trustworthy place to get your phone fixed I recommend coming to this place for phone repairs."
        },
        "34": {
            "user": "Carlo K.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "8/20/2016",
            "comment": "Anthony did a great job replacing my cracked iphone screen! Best part was it was so fast! 20 mins and ur all set! He also said it comes with a 6 month warranty which is great!"
        },
        "35": {
            "user": "Matthew C.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "1/1/2017",
            "comment": "Anthony was great! Went above and beyond to find the trouble my iphone was having. Will definitely be back in the future. \\u00a0Fixed the iphone screen in 15 minutes."
        },
        "36": {
            "user": "Punk A.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "8/6/2016",
            "comment": "Love this guy Anthony - helped me choose a color. \\u00a0They have cool tempered glass covers for iPhone 6 & 6+ at great prices. I have never done anything but plastic. So cool! I also put this review in my Facebook page. \\u00a0Boom!"
        },
        "37": {
            "user": "Heather R.",
            "rating": 5,
            "location": "Studio City, CA",
            "date posted": "8/4/2016",
            "comment": "Anthony is amazing! Best price I\'ve found so far, and my phone was SO cracked, I never thought it could be fixed. Looks better than new! Wish I could take a picture to show how great it looks! Thank you Anthony!!"
        },
        "38": {
            "user": "Krissy K.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "2/1/2018",
            "comment": "This is my go to place!! I can\'t believe my phone is looking brand new again. Joshua helped me out! The service is so great and professional and fast. I will never go anywhere else but here again!"
        },
        "39": {
            "user": "Kristine M.",
            "rating": 5,
            "location": "Burbank, CA",
            "date posted": "9/19/2016",
            "comment": "Matt works wonders! He fixed my screen and my camera in a matter of minutes and worked like new!! He gave me a great discount and a 6 month warranty for my camera if anything was to happen. Very professional and kind! You won\'t regret it!"
        },
        "40": {
            "user": "Kim M.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "6/29/2016",
            "comment": "My iPhone 5 screen was not responding so I took it to Ucolor and Matt got it working good as new in no time! Took him only 20 minutes and they were allot less expensive then the Galleria! Thanks UColor!"
        },
        "41": {
            "user": "Danny C.",
            "rating": 5,
            "location": "Northridge, Los Angeles, CA",
            "date posted": "6/11/2016",
            "comment": "Matt fixed my iphone 6 very fast and with great customer service. Highly recommended. These guys are great! \\u00a0Thanks Ucolor"
        },
        "42": {
            "user": "Linds L.",
            "rating": 5,
            "location": "Long Beach, CA",
            "date posted": "7/18/2016",
            "comment": "Cracked my iPhone 6 Plus screen pretty badly.. After looking for places to get my phone fixed, I came to this one.. Location is very convenient (at Americana right in between Topshop and Katsuya), and he\'s here til pretty late. He was done with my phone in about 15-20 minutes and threw in the screen protector for this review ;) Would come back if I needed repairs *knock on wood"
        },
        "43": {
            "user": "Arthur C.",
            "rating": 5,
            "location": "Highland Park, Los Angeles, CA",
            "date posted": "7/11/2016",
            "comment": "My home button wasn\'t working on my 5s so I took it to Apple and they said they could only replace the phone... I wasn\'t trying to spend a whole lot of money so I left. I stumbled upon the ucolor kiosk and Matt ended up replacing it for only $30. Works great and now I don\'t have to use this stupid assistive touch anymore!"
        },
        "44": {
            "user": "Odelia S.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "7/9/2016",
            "comment": "My charging port wasn\'t working, I had to keep twisting it around to get it to charge. I took my phone to Matt at the Ucolor kiosk and he found that it was just lint stuck inside the port. He pulled it out and fix it in the matter of seconds! Now my phone is charging and I didn\'t have to spend allot of money! Thanks Ucolor!!"
        },
        "45": {
            "user": "arsen s.",
            "rating": 1,
            "location": "Glendale, CA",
            "date posted": "8/14/2016",
            "comment": "The worst service you could get ever. 2 weeks after replacing my iPhone screen it stopped working. when i took it back to fix it they denied saying that screen has scratch.Be careful, never trust these guys. apple store charges the same price as ucolor."
        },
        "46": {
            "user": "Amanda S.",
            "rating": 5,
            "location": "Aurora, CO",
            "date posted": "7/12/2016",
            "comment": "Broke my iPhone 6 and stopped by Ucolor to have them fix. Found them through Yelp and saw all the great reviews. Anthony helped me and was quick and thorough. He explained everything in detail and finished my phone in 15-20 min. Thank you Ucolor, I will be back again and will recommend you to my friends and family!"
        },
        "47": {
            "user": "Alan G.",
            "rating": 1,
            "location": "Glendale, CA",
            "date posted": "8/13/2016",
            "comment": "Ruined my phone. Don\'t go here to get your phone fixed. It\'s a waste of money. Go to apple or Samsung so they can do it right. Not like these jokers."
        },
        "48": {
            "user": "Robin J.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "6/8/2017",
            "comment": "Jose was so awesome! He gave us a great deal and it literally took twenty minutes for him to replace my screen. So happy with this service! Would highly recommend to anyone!"
        },
        "49": {
            "user": "Georgia O.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/28/2016",
            "comment": "Awesome! So easy - literally 15 minutes and totally fixed. Anthony is super nice and really knows what he\'s doing. If you\'re looking for fast and low stress repair, go here"
        },
        "50": {
            "user": "Hovik T.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "7/10/2016",
            "comment": "Quick and fast service, reasonable & competitive \\u00a0pricing. Anthony fixed our IPHONE 6 screen and serviced it, looks amazing and works fast just when we bought it new."
        },
        "51": {
            "user": "Shehab H.",
            "rating": 5,
            "location": "Mission Viejo, CA",
            "date posted": "3/26/2017",
            "comment": "Matt fixed my phone in no time. I am happy with the service and highly recommend them."
        },
        "52": {
            "user": "patricia p.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/13/2016",
            "comment": "I was using my headphones on my iPhone and when I pulled the cable out, a piece of the headphone was stuck in the headphone jack. I took it to Apple and it didn\'t fall under warranty so they wanted to replace the phone for $299. Ended up taking it to the Ucolor kiosk and Matt pulled it out no problem! Thanks guys! Saved me allot of money and time."
        },
        "53": {
            "user": "Dana C.",
            "rating": 2,
            "location": "Canyon Country, CA",
            "date posted": "8/8/2016",
            "comment": "I would not recommend this place for screen repair. I got mine done two weeks ago, and have had to go back twice since then, and it\'s still not working right. I don\'t have time to keep going back."
        },
        "54": {
            "user": "Whitney U.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "8/7/2016",
            "comment": "Anthony was so great. Helpful, professional, and INSANELY fast! Highly recommend. Thank you so much!!"
        },
        "55": {
            "user": "Patrick P.",
            "rating": 5,
            "location": "Burbank, Los Angeles, CA",
            "date posted": "12/15/2016",
            "comment": "Broke my 6+ a couple weeks ago and shopped around for the best price. Came across Ucolor Americana and Anthony took care of it for $109! Best deal in town! He finished it in 20 minutes and even fixed the dents on the corners at no additional cost. I highly recommend these guys and especially Anthony for being fast and efficient. Even replacing screws that were missing. Thanks again!"
        },
        "56": {
            "user": "Anton A.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/12/2016",
            "comment": "Anthony was quick and very friendly. Fixed my fiancee\'s phone within 15 mins. Good job Anthony will do business again."
        },
        "57": {
            "user": "Andrew A.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "7/10/2016",
            "comment": "Great, quality repair service. Repaired my screen and dusted/cleaned my phone as well. Very honest; didn\'t try to sell me something I didn\'t need and prices are fair. Definitely recommend!"
        },
        "58": {
            "user": "Gary M.",
            "rating": 5,
            "location": "Studio City, CA",
            "date posted": "7/8/2016",
            "comment": "Awesome job repairing an iPhone 6 that had water damage. Daughter dropped in sink. Anthony did a great job fixing the problems. Just like new. Awesome Job!"
        },
        "59": {
            "user": "Diana Y.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "6/26/2016",
            "comment": "How amazing is this place ?!!! Anthony is the best he changed my screen cover within 15 mins and it works amazing ! Highly recommend him to anyone ! Fast ! East ! Not overpriced at all !"
        },
        "60": {
            "user": "Shawn M.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "10/29/2016",
            "comment": "This place amazing! both Anthony and Matt have awesome skills at fixing phones they literally know what they are doing , my phone was damaged and i thought i needed a new phone but they proved me wrong and got the job done ! Not to mention they are both very nice people"
        },
        "61": {
            "user": "Deepa P.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "8/4/2016",
            "comment": "My phone was cracked really bad and wasn\'t sure if it was going to be able to be fixed. Anthony was awesome. He was very professional and fixed it very quickly while we ate lunch. I definitely recommend brining your phone to Anthony. He knows what he is doing. Thank you u color! I will definitely be recommending your place to anyone I see with a cracked phone :)"
        },
        "62": {
            "user": "Hugo C.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/10/2016",
            "comment": "Super convenient. Anthony was very helpful. Definitely coming here to fix my iPhone/iPad."
        },
        "63": {
            "user": "joanna s.",
            "rating": 5,
            "location": "Los Angeles, CA",
            "date posted": "7/1/2016",
            "comment": "Anthony is so awesome. He fixed my phone in a couple of minutes and was very friendly. Highly recommend."
        },
        "64": {
            "user": "Marty A.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "6/25/2016",
            "comment": "Just had my iPhone 6 screen repaired by Matt at Ucolor kiosk at The Americana...he did an awesome job. Very convenient, fixed it on the spot, only took about 15-20 min. Price was competitive and worth it. \\u00a0I recommend Ucolor to anyone needing their phone, IPad, etc fixed. You can grab a bite or do your shopping while you get your phone fixed. Awesome!! Thanks Matt, saved me the headache from driving somewhere else. Marty"
        },
        "65": {
            "user": "Lucy B.",
            "rating": 5,
            "location": "Glendale, CA",
            "date posted": "7/2/2016",
            "comment": "I just got my phone fixed here from Matt. My iphone 6 plus power button wasnt working. I took it to a few places and they were not able to fix the problem but Mat here replaced the issue. Apple would not fix it as they said they only replace the phone."
        }
    }
}'